import React from "react";
import Layout from "./../components/Layout/Layout";
import { Box, Typography } from "@mui/material";

const About = () => {
  return (
    <Layout>
      <Box
        sx={{
          my: 15,
          textAlign: "center",
          p: 2,
          "& h4": {
            fontWeight: "bold",
            my: 2,
            fontSize: "2rem",
          },
          "& p": {
            textAlign: "center",
          },
          "@media (max-width:600px)": {
            mt: 0,
            "& h4 ": {
              fontSize: "1.5rem",
            },
          },
        }}
      >
        <Typography variant="h4">Հայաստանի պատմության թանգարան</Typography>
        <p>
        Հայաստանի պատմության թանգարանն ազգային նշանակության մշակութային կազմակերպություն է, որն ավելի քան մեկ դար շարունակ ձեռք է բերում, հավաքում, հայտնաբերում, հաշվառում, պահպանում, ուսումնասիրում, մեկնաբանում և ցուցադրում Հայաստանին ու հայ ժողովրդին առնչվող նյութական և ոչ նյութական մշակութային արժեքներ՝ նպաստելով գիտության, կրթության, զբոսաշրջության զարգացմանը։
Շուրջ չորս հարյուր հազար հնագիտական, ազգագրական, դրամագիտական և այլ հավաքածուների հիման վրա է թանգարանը փորձում կամրջել անցյալն ու ապագան։
Թանգարանային հավաքածուն արտացոլում է Հայաստանի մշակույթի և պատմության ամբողջական պատկերը՝ նախապատմական ժամանակներից (մեզանից մեկ միլիոն ութ հարյուր հազար տարի առաջ) մինչև մեր օրերը։
Թանգարանը հիմնադրվել է Հայաստանի Առաջին Հանրապետության պառլամենտի համար 439 օրենքով (09.09.1919թ.): Կոչվել է Ազգագրական-մարդաբանական թանգարան-գրադարան: Բացվել է այցելուների համար 1921 թ. օգոստոսի 20-ին։ Կրել է անվանափոխություններ. Հայաստանի պետական կենտրոնական (1922թ.), Կուլտուր-պատմական (1931թ.), Պատմական (1935թ.), Հայաստանի պատմության պետական թանգարան (1962թ.) և Հայաստանի պատմության թանգարան (2003թ.)։
        </p>
      </Box>
    </Layout>
  );
};

export default About;